        IDENTIFICATION DIVISION.
        PROGRAM-ID. CMPRCLNT.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
			SELECT DEMO ASSIGN TO AS-CLNTFILE.
			SELECT DELTA ASSIGN TO "/upload/delta.txt"
			FILE STATUS IS FILE-STATUS.
	  *************************************************
	  * Program used to process the Client Delta file 
	  * for nighly updates of the Client file.
	  * Calls program PROCCLNT to write data to file.
	  * Record length 498 chars
	  * Date        Author   Description
	  * 07/01/2025  JMelton   Initial program version
	  **************************************************
       DATA DIVISION.
       FILE SECTION.
       FD DELTA.
		  01 INCLNTREC
			 COPY ICLNTREC.
	   FD DEMO.
       01 CLNTREC.
           COPY OCLNTREC.
       WORKING-STORAGE SECTION.
	   01 WS-EOF        PIC X(01) VALUE 'N'.
	   01 FILE-STATUS   PIC X(02) VALUE ZERO.
       01 PROCESS       PIC 9(02) VALUE ZERO.
       01 CLNTIDEN      PIC 9(5)  VALUE ZERO.
	   01 WS-STATUS     PIC 9(02) VALUE ZERO.
	   01 WS-COUNT      PIC 9(07) VALUE ZERO.
	   01 EOF-MESSAGE.
		  05 FILLER          PIX X(40) VALUE 'OB COMPLETED SUCCESSFULLY, RECORDS PROCESSED = ' WS-COUNT.
	   01 ERROR-MESSAGE.
		  05 FILLER          PIC X(14) VALUE 'FILE STATUS -'.
		  05 ERR-FILE-STATUS PIC X(02).
		  05 FILLER          PIC X(12) VALUE ' CLIENT ID -'.
		  05 ERR-CLNT-ID     PIC X(05).
		  05 FILLER          PIC X(13) VALUE 'TRANSACTION -'. 
		  05 ERR-CLNT-PROC   PIC X(02).
		  05 ERR-CLNT-MSG    PIC X(50).
		   
	  *******COPY OCLNTREC FOR CALLED PROGRAM PROCCLNT
	      COPY 'OCLNTREC'.
		   
       PROCEDURE DIVISION.
      
		
	   1000-MAIN.
		
		   PERFORM 2000-OPEN-FILES THRU 2000-OPEN-INPUT-EXIT.
			
		   PERFORM 3000-READ-DELTA UNTIL WS-EOF = 'Y'.
			
		   PERFORM 3500-CLOSE-JOB THRU 3500-CLOSE-JOB-EXIT.
		
	   1000-MAIN-EXIT.
		   EXIT.
			
	  ********IS THE DEMO FILE INDEXED? IF SO DO START
      ********MOVE ICLNTIDEN TO CALL FIELD FOR READ OR 
      ********SIMPLY DO A READ TO FIND IDENTIFIER CLNTIDEN	   
	   2000-OPEN-FILES.
	   
		   OPEN INPUT DELTA.
		   IF WS-STATUS NOT EQUAL '00'									`
		      MOVE WS-STATUS TO ERR-FILE-STATUS
			  MOVE ICLNTIDEN TO ERR-CLNT-ID
			  MOVE IPROCESS TO ERR-CLNT-PROC
			  MOVE 'ERROR ON OPENING FILE IN 2000 PARAGRAPH' TO ERR-CLNT-MSG
			  MOVE 'Y' TO WS-EOF
			  DISPLAY WS-ERROR-MESSAGE
		   END-IF.
		   
		   OPEN OUTPUT DEMO.
           IF WS-STATUS NOT EQUAL '00'									`
		      MOVE WS-STATUS TO ERR-FILE-STATUS
			  MOVE ICLNTIDEN TO ERR-CLNT-ID
			  MOVE IPROCESS TO ERR-CLNT-PROC
			  MOVE 'ERROR ON OPENING FILE IN 2000 PARAGRAPH' TO ERR-CLNT-MSG
			  MOVE 'Y' TO WS-EOF
			  DISPLAY WS-ERROR-MESSAGE
		   END-IF.
			  
	   2000-OPEN-FILES-EXIT.
		   EXIT.
			
	   3000-READ-DELTA.
	   
		   MOVE SPACES TO OCLNTREC.
		   MOVE ICLNTREC TO OCLNTREC.
			
			CALL 'PROCCLNT'
			   USING OCLNTREC.
			   
			IF WS-STATUS NOT EQUAL '00'									`
		      MOVE WS-STATUS TO ERR-FILE-STATUS
			  MOVE ICLNTIDEN TO ERR-CLNT-ID
			  MOVE IPROCESS TO ERR-CLNT-PROC
			  MOVE 'ERROR ON PROCCLNT CALL IN 3000 PARAGRAPH' TO ERR-CLNT-MSG
			  MOVE 'Y' TO WS-EOF
			  DISPLAY WS-ERROR-MESSAGE
		   END-IF.
		
	   3000-READ-DELTA-EXIT.
		   EXIT.
		   
	   3500-CLOSE-JOB.
	   
		  CLOSE DELTA.
		  CLOSE DEMO.
		  DISPLAY EOF-MESSAGE.
	   
	   3500-CLOSE-JOB-EXIT.
	       EXIT.